robert_maculewicz/week_05/day_02/mountains_app/app/controllers/mountains_controller.rb

INSERT INTO "mountains" ("name", "image", "height", "first") VALUES (?, ?, ?, ?)  [["name", "Robert"], ["image", "https://www.westernsydney.edu.au/__data/assets/image/0003/1013907/fireweed.jpg"], ["height", 1.0], ["first", "dcefe"]]
---
  def create
    mountain = Mountain.new
    mountain.name = params[:name]
    mountain.image = params[:image]
    mountain.height = params[:height]
    mountain.first = params[:first]
    mountain.save

SELECT  "mountains".* FROM "mountains" WHERE "mountains"."id" = ? LIMIT ?  [["id", 30], ["LIMIT", 1]]
UPDATE "mountains" SET "image" = ?, "height" = ?, "first" = ? WHERE "mountains"."id" = ?  [["image", "https://i.ytimg.com/vi/YRj73MD3jTw/maxresdefault.jpg"], ["height", 8999.0], ["first", "Robert"], ["id", 30]]
---
  def update
    mountain = Mountain.find params[:id]
    mountain.name = params[:name]
    mountain.image = params[:image]
    mountain.height = params[:height]
    mountain.first = params[:first]
    mountain.save