soheil_tajahmadi/week_05/day_02/iranian_mounts/app/controllers/mountains_controller.rb

  def home
    @mountains = Mountain.all
---
SELECT "mountains".* FROM "mountains"

  def details
    @mountain = Mountain.find params[:id]
---
SELECT  "mountains".* FROM "mountains" WHERE "mountains"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

  def create
    mountain = Mountain.new
    mountain.name = params[:name]
    mountain.elevation = params[:elevation]
    mountain.prominence = params[:prominence]
    mountain.image = params[:image]
    mountain.funfact = params[:funfact]
    mountain.save
---
INSERT INTO "mountains" ("name", "elevation", "image", "funfact") VALUES (?, ?, ?, ?)  [["name", "alam-kuh"], ["elevation", 4848], ["image", ""], ["funfact", ""]]

  def update
    mountain = Mountain.find params[:id]
    mountain.name = params[:name]
    mountain.elevation = params[:elevation]
    mountain.prominence = params[:prominence]
    mountain.image = params[:image]
    mountain.funfact = params[:funfact]
    mountain.save
---
SELECT  "mountains".* FROM "mountains" WHERE "mountains"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
UPDATE "mountains" SET "elevation" = ?, "prominence" = ?, "image" = ?, "funfact" = ? WHERE "mountains"."id" = ?