wenjun_liu/week_05/day_03/football/app/controllers/clubs_controller.rb

SELECT  "clubs".* FROM "clubs" WHERE "clubs"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def show
    @club = Club.find params[:id]

SELECT  "clubs".* FROM "clubs" WHERE "clubs"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def edit
    @club = Club.find params[:id]

SELECT  "clubs".* FROM "clubs" WHERE "clubs"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "clubs" SET "name" = $1, "updated_at" = $2 WHERE "clubs"."id" = $3  [["name", "aaa2"], ["updated_at", "2018-07-11 13:18:32.802208"], ["id", 1]]
---
  def update
    club = Club.find params[:id]
    club.update club_params

INSERT INTO "clubs" ("name", "region", "img", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["name", "asdas"], ["region", "dsd"], ["img", "https://www.fillmurray.com/200/300"], ["created_at", "2018-07-11 13:18:39.318647"], ["updated_at", "2018-07-11 13:18:39.318647"]]
---
  def create
    club = Club.create club_params