wenjun_liu/week_05/day_03/football/app/controllers/players_controller.rb

  def show
    @player = Player.find params[:id]
---
SELECT  "players".* FROM "players" WHERE "players"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]

  def edit
    @player = Player.find params[:id]
---
SELECT  "players".* FROM "players" WHERE "players"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]

  def update
    player = Player.find params[:id]
    player.update player_params
---
SELECT  "players".* FROM "players" WHERE "players"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
UPDATE "players" SET "nationality" = $1, "updated_at" = $2 WHERE "players"."id" = $3  [["nationality", "aawe"], ["updated_at", "2018-07-11 13:00:45.380370"], ["id", 3]]

  def create
    player = Player.create player_params
---
INSERT INTO "players" ("name", "nationality", "position", "dob", "club_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"

  def destroy
    player = Player.find params[:id]
    player.destroy
---
SELECT  "players".* FROM "players" WHERE "players"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
DELETE FROM "players" WHERE "players"."id" = $1  [["id", 2]]