wenjun_liu/week_05/day_03/football/app/views/players/_form.html.erb

SELECT "clubs"."name", "clubs"."id" FROM "clubs"
---
  <%= p.label :Club %>
  <%= p.select :club_id, Club.pluck(:name, :id), :include_blank => true %>