wenjun_liu/week_05/day_03/football/app/views/players/show.html.erb

  <% end %>
  <% if @player.club.present?  %>
---
SELECT  "clubs".* FROM "clubs" WHERE "clubs"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]