soheil_tajahmadi/week_05/day_03/library/app/views/books/_form.html.erb

SELECT "authors"."name", "authors"."id" FROM "authors"
---
  <%= f.label :author_id %>
  <%= f.select :author_id, Author.pluck(:name, :id), :include_blank => true %>