soheil_tajahmadi/week_05/day_03/library/app/views/books/show.html.erb

  <li><%= @book.title %></li>
  <% if @book.author.present? %>
---
SELECT  "authors".* FROM "authors" WHERE "authors"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]