sherine_foo/week_05/day_02/hiking_trip/app/controllers/mountains_controller.rb

  def create
    mountain = Mountain.new
    mountain.name = params[:name]
    mountain.height = params[:height]
    mountain.distance = params[:distance]
    mountain.country = params[:country]
    mountain.image = params[:image]
    mountain.save
---
INSERT INTO "mountains" ("name", "image", "country") VALUES (?, ?, ?)  [["name", "Sherine"], ["image", "https://www.scifi-movies.com/images/contenu/data/0003904/affiche-vivre-et-laisser-mourir-live-and-let-die-1973-10.jpg"], ["country", ""]]