wenjun_liu/week_05/day_02/mountains_app/app/controllers/mountains_controller.rb

  def create
    mountain = Mountain.new
    mountain.name = params[:name]
    mountain.category = params[:category]
    mountain.country = params[:country]
    mountain.height = params[:height]
    mountain.save
---
INSERT INTO "mountains" ("name", "category", "country", "height") VALUES (?, ?, ?, ?)  [["name", "dsad"], ["category", "asd"], ["country", "dasd"], ["height", 21.0]]

  def update
    mountain = Mountain.find params[:id]
    mountain.name = params[:name]
    mountain.category = params[:category]
    mountain.country = params[:country]
    mountain.height = params[:height]
    mountain.save
---
SELECT  "mountains".* FROM "mountains" WHERE "mountains"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "mountains" SET "height" = ? WHERE "mountains"."id" = ?  [["height", 22.0], ["id", 1]]