zabrina_lagamayo/week_05/day_02/water/app/controllers/oceans_controller.rb

SELECT "oceans".* FROM "oceans"
---
  def index
    @oceans = Ocean.all

SELECT  "oceans".* FROM "oceans" WHERE "oceans"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def show
    @ocean = Ocean.find params[:id]

INSERT INTO "oceans" ("name", "image") VALUES (?, ?)  [["name", "Zabrina"], ["image", ""]]
---
  def create
    ocean = Ocean.new
    ocean.name = params[:name]
    ocean.image = params[:image]
    ocean.save

SELECT  "oceans".* FROM "oceans" WHERE "oceans"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]
---
  def edit
    @ocean = Ocean.find params[:id]

SELECT  "oceans".* FROM "oceans" WHERE "oceans"."id" = ? LIMIT ?  [["id", 5], ["LIMIT", 1]]
UPDATE "oceans" SET "name" = ?, "image" = ? WHERE "oceans"."id" = ?  [["name", nil], ["image", nil], ["id", 5]]
---
  def update
    ocean = Ocean.find params[:id]
    ocean.name = params[:name]
    ocean.image = params[:image]
    ocean.save

SELECT  "oceans".* FROM "oceans" WHERE "oceans"."id" = ? LIMIT ?  [["id", 5], ["LIMIT", 1]]
DELETE FROM "oceans" WHERE "oceans"."id" = ?  [["id", 5]]
---
  def destroy
    ocean = Ocean.find params[:id]
    ocean.destroy