shelley_zhang/week_05/day_03/gamedev/app/controllers/developers_controller.rb

  def index
    @developers = Developer.all.order(:created_at)
---
SELECT "developers".* FROM "developers" ORDER BY "developers"."created_at" ASC

  def show
    @developer = Developer.find params[:id]
---
SELECT  "developers".* FROM "developers" WHERE "developers"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]

  def edit
    @developer = Developer.find params[:id]
---
SELECT  "developers".* FROM "developers" WHERE "developers"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]

  def update
    developer = Developer.find params[:id]
    developer.update developer_params
---
SELECT  "developers".* FROM "developers" WHERE "developers"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
UPDATE "developers" SET "headquarters" = $1, "updated_at" = $2 WHERE "developers"."id" = $3  [["headquarters", "United States2"], ["updated_at", "2018-07-11 11:58:03.874160"], ["id", 3]]

  def create
    developer = Developer.create developer_params
---
INSERT INTO "developers" ("name", "headquarters", "image", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["name", "blah "], ["headquarters", "blah"], ["image", ""], ["created_at", "2018-07-11 12:09:33.332408"], ["updated_at", "2018-07-11 12:09:33.332408"]]

  def destroy
    developer = Developer.find params[:id]
    developer.destroy
---
SELECT  "developers".* FROM "developers" WHERE "developers"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
DELETE FROM "developers" WHERE "developers"."id" = $1  [["id", 3]]