shelley_zhang/week_05/day_03/gamedev/app/controllers/games_controller.rb

SELECT  "games".* FROM "games" WHERE "games"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def show
    @game = Game.find params[:id]

INSERT INTO "games" ("name", "genre", "image", "created_at", "updated_at", "developer_id") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["name", "re"], ["genre", "sadf"], ["image", ""], ["created_at", "2018-07-11 12:23:00.437228"], ["updated_at", "2018-07-11 12:23:00.437228"], ["developer_id", 5]]
---
  def create
    game = Game.create game_params

SELECT  "games".* FROM "games" WHERE "games"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "games" SET "developer_id" = $1, "updated_at" = $2 WHERE "games"."id" = $3  [["developer_id", 4], ["updated_at", "2018-07-11 12:22:48.858216"], ["id", 1]]
---
  def update
    game = Game.find params[:id]
    game.update game_params

SELECT  "games".* FROM "games" WHERE "games"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
DELETE FROM "games" WHERE "games"."id" = $1  [["id", 2]]
---
  def destroy
    game = Game.find params[:id]
    game.destroy