sherine_foo/week_05/day_03/movie_directors/app/views/movies/_form.html.erb

SELECT "directors"."name", "directors"."id" FROM "directors"
---
  <%= f.label :director_id %>
  <%= f.select :director_id, Director.pluck(:name, :id), include_blank => true %>