ej_willard/week_05/day_02/mountains_app/app/controllers/mountains_controller.rb

  def index
    #next need to define global var for info contained in mountains.
    @mountains = Mountain.all
---
SELECT "mountains".* FROM "mountains"

  def show
    #need to GET/FIND the mountain by its params, want to use @mountain singular as it just related to ONE mountain when you SHOW it.
    @mountain = Mountain.find params[:id]
---
SELECT  "mountains".* FROM "mountains" WHERE "mountains"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

  def create
      #new is where the form is .. need to get everything from the form and post it through to page...same stuff we did in pry to create other two  mountains.
    mountain = Mountain.new
    mountain.name = params[:name]
    mountain.height = params[:height]
    mountain.volcanic = params[:volcanic]
    mountain.image = params[:image]
    mountain.save
---
INSERT INTO "mountains" ("name", "height", "volcanic", "image") VALUES (?, ?, ?, ?)  [["name", "Mount Kosciuszko"], ["height", 2228.0], ["volcanic", 1], ["image", "https://static.domain.com.au/twr/production/uploads/2018/05/28214635/TWR-Travel-Mount-Kosciuszko-1-web.jpg"]]

  def update
    mountain = Mountain.find params[:id]
    mountain.name = params[:name]
    mountain.height = params[:height]
    mountain.volcanic = params[:volcanic]
    mountain.image = params[:image]
    mountain.save
---
SELECT  "mountains".* FROM "mountains" WHERE "mountains"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "mountains" SET "image" = ? WHERE "mountains"."id" = ?  [["image", "https://fillmurray.com/40/40"], ["id", 1]]