sonia_parker/week_05/day_02/oceans_app/app/controllers/oceans_controller.rb

SELECT "oceans".* FROM "oceans"
---
def index # lit of all oceans
  @oceans = Ocean.all

INSERT INTO "oceans" ("name", "average_depth", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["name", "fdfd"], ["average_depth", 9], ["created_at", "2018-07-10 10:28:57.380935"], ["updated_at", "2018-07-10 10:28:57.380935"]]
---
def create # code for saving newly created ocean
  ocean = Ocean.new
ocean.name = params[:name]
ocean.image_url = params[:image_url]
ocean.average_depth = params[:average_depth]
ocean.save

SELECT  "oceans".* FROM "oceans" WHERE "oceans"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def show # show id of ocean with image
        @ocean = Ocean.find params[:id]

SELECT  "oceans".* FROM "oceans" WHERE "oceans"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
---
  def edit # form for editing existing ocean
  @ocean = Ocean.find params[:id]

SELECT  "oceans".* FROM "oceans" WHERE "oceans"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
UPDATE "oceans" SET "name" = ?, "average_depth" = ?, "updated_at" = ? WHERE "oceans"."id" = ?  [["name", "hhhhhhhhh"], ["average_depth", 40], ["updated_at", "2018-07-10 10:39:03.735487"], ["id", 3]]
---
  def update # save edited ocean
  @ocean = Ocean.find params[:id]
  @ocean.name = params[:name]
  @ocean.image_url = params[:image_url]
  @ocean.average_depth = params[:average_depth]
  @ocean.save

SELECT  "oceans".* FROM "oceans" WHERE "oceans"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
DELETE FROM "oceans" WHERE "oceans"."id" = ?  [["id", 2]]
---
  def destroy
    @ocean = Ocean.find params[:id]
    @ocean.destroy