shelley_zhang/week_05/day_03/gamedev/app/views/developers/show.html.erb

SELECT "games".* FROM "games" WHERE "games"."developer_id" = $1  [["developer_id", 3]]
---

<% @developer.games.each do |game| %>