soheil_tajahmadi/week_05/day_03/library/app/views/authors/show.html.erb

SELECT "books".* FROM "books" WHERE "books"."author_id" = $1  [["author_id", 1]]
---
<ul>
<% @author.books.each do |book| %>