soheil_tajahmadi/week_05/day_03/library/app/controllers/authors_controller.rb

  def show
    @author = Author.find params[:id]
---
SELECT  "authors".* FROM "authors" WHERE "authors"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

  def edit
    @author = Author.find params[:id]
---
SELECT  "authors".* FROM "authors" WHERE "authors"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

  def update
    author = Author.find params[:id]
    author.update author_params
---
SELECT  "authors".* FROM "authors" WHERE "authors"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "authors" SET "born" = $1, "quote" = $2, "funfact" = $3, "updated_at" = $4 WHERE "authors"."id" = $5

  def create
    author = Author.create author_params
---
INSERT INTO "authors" ("name", "born", "quote", "funfact", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"

  def destroy
    author = Author.find params[:id]
    author.destroy
---
SELECT  "authors".* FROM "authors" WHERE "authors"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
DELETE FROM "authors" WHERE "authors"."id" = $1  [["id", 3]]