soheil_tajahmadi/week_05/day_03/library/app/controllers/books_controller.rb

  def show
    @book = Book.find params[:id]
---
SELECT  "books".* FROM "books" WHERE "books"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

  def create
      book = Book.create book_params
---
INSERT INTO "books" ("title", "year", "genre", "author_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["title", "The Purple Cow"], ["year", 2003], ["genre", "Non-fiction"], ["author_id", 1], ["created_at", "2018-07-11 14:22:34.365550"], ["updated_at", "2018-07-11 14:22:34.365550"]]

  def edit
    @book = Book.find params[:id]
---
SELECT  "books".* FROM "books" WHERE "books"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

  def update
    book = Book.find params[:id]
    book.update book_params
---
SELECT  "books".* FROM "books" WHERE "books"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "books" SET "year" = $1, "genre" = $2, "author_id" = $3, "updated_at" = $4 WHERE "books"."id" = $5  [["year", 2010], ["genre", "Self-help"], ["author_id", 1], ["updated_at", "2018-07-11 14:19:54.718937"], ["id", 1]]