shelley_zhang/week_05/day_02/oceans_app/app/controllers/oceans_controller.rb

def index
  @oceans = Ocean.all
---
SELECT "oceans".* FROM "oceans"

def show
  @ocean = Ocean.find params[:id]
---
SELECT  "oceans".* FROM "oceans" WHERE "oceans"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

def create
  ocean = Ocean.new
  ocean.name = params[:name]
  ocean.image = params[:image]
  ocean.surface = params[:surface]
  ocean.depth = params[:depth]
  ocean.volume = params[:volume]
  ocean.save
---
INSERT INTO "oceans" ("name", "image", "surface", "depth") VALUES (?, ?, ?, ?)  [["name", "Pacific Ocean"], ["image", "https://en.wikipedia.org/wiki/Arctic_Ocean"], ["surface", 165250000.0], ["depth", 4280.0]]

def edit
  @ocean = Ocean.find params[:id]
---
SELECT  "oceans".* FROM "oceans" WHERE "oceans"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

def update
  ocean = Ocean.find params[:id]
  ocean.name = params[:name]
  ocean.image = params[:image]
  ocean.surface = params[:surface]
  ocean.depth = params[:depth]
  ocean.volume = params[:volume]
  ocean.save
---
SELECT  "oceans".* FROM "oceans" WHERE "oceans"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "oceans" SET "image" = ?, "volume" = ? WHERE "oceans"."id" = ?  [["image", "https://s-i.huffpost.com/gen/1438088/images/n-PACIFIC-OCEAN-WARMING-628x314.jpg"], ["volume", 710000000.0], ["id", 1]]

def destroy
  ocean = Ocean.find params[:id]
  ocean.destroy
---
SELECT  "oceans".* FROM "oceans" WHERE "oceans"."id" = ? LIMIT ?  [["id", 5], ["LIMIT", 1]]
DELETE FROM "oceans" WHERE "oceans"."id" = ?  [["id", 5]]