shelley_zhang/week_05/day_03/gamedev/app/views/games/_form.html.erb

SELECT "developers"."name", "developers"."id" FROM "developers"
---
  <%= f.label :developer_id %>
  <%= f.select :developer_id, Developer.pluck(:name, :id), :include_blank => true %>