sherine_foo/week_05/day_03/movie_directors/app/controllers/directors_controller.rb

  def index
    @directors = Director.all.order(:created_at)
---
SELECT "directors".* FROM "directors" ORDER BY "directors"."created_at" ASC

  def show
    @director = Director.find params[:id]
---
SELECT  "directors".* FROM "directors" WHERE "directors"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

  def edit
    @director = Director.find params[:id]
---
SELECT  "directors".* FROM "directors" WHERE "directors"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

  def update
    director = Director.find params[:id]
    director.update director_params
---
SELECT  "directors".* FROM "directors" WHERE "directors"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "directors" SET "dob" = $1, "updated_at" = $2 WHERE "directors"."id" = $3  [["dob", 1956], ["updated_at", "2018-07-11 20:26:20.622785"], ["id", 1]]

  def create
    director = Director.create director_params
---
INSERT INTO "directors" ("name", "nationality", "dob", "image", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"

  def destroy
    director = Director.find params
---
SELECT  "directors".* FROM "directors" WHERE "directors"."id" = $1 LIMIT $2  [["id", nil], ["LIMIT", 1]]