sherine_foo/week_05/day_03/movie_directors/app/controllers/movies_controller.rb

  def show
    @movie = Movie.find params[:id]
---
SELECT  "movies".* FROM "movies" WHERE "movies"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]